{
    "meta": {
        "title": "Annotate the most important regions on graphic designs",
        "description": "Manually highlight the important parts of a graphic design. You will be shown a set of 10 images, and you will have to indicate which parts feel important to you.",
        "numSubtasks": 1,
        "disclaimer": "This is a disclaimer. You are participating in this experiment voluntarily.",
        "aggregate": false,
        "imgsPerFold": 10
    },
    "instructions": {
        "simple": "Your task is to highlight the most important regions (either graphics or text) in 10 images. These regions help you understand what the image is about. You can select multiple regions per image. Don't worry about making the boundaries of the annotation super precise. You will have 1 minute per image. <b>Please ignore watermarks</b> (they will have a diamond pattern and say Canva in the middle. Act as if they weren't there).<br><br>You have 3 tools you can use to annotate images (in the menu bar on the right-side of the image). Please pick whichever you prefer. You can try out different options.<br><br><b>To annotate using the Stroke Fill (default):</b><br>(1) Click on the edge of the element you would like to trace around.<br>(2) While holding the mouse down, trace around the element until you reach your approximate starting point.<br>(3) A nice outline will be automatically created. If you are unsatisfied with it, you can click 'Undo'.<br><br>A demonstration of Stroke Fill can be seen in the sample video below.<br><br><b>To annotate using the Polygon Fill:</b><br>(1) Click on the Polygon Fill button on the right menu.<br>(2) Click on the edge of the element you want to annotate.<br>(3) Let go of the mouse and move it towards a new edge. A straight line between the starting point and your mouse position will be automatically created.<br>(3) Click again to generate a new point.<br>(4) Continue outlining the object until you reach your starting point, indicated by a blue circle. Clicking on the blue circle completes the annotation.<br><br><b>To annotate using the Regular Stroke:</b><br>(1) Click on the Regular Stroke button on the right menu.<br>(2) Pick a Brush Size (or go with the default).<br>(3) Paint over the whole image region you want to select as important.<br>If possible, try to avoid this method, as it produces noisy boundaries.<br><br>When you are done annotating all 5 images, you will see a completion screen, at which point you will be able to submit the HIT.<br><br>Note: this task should not take long. This is why there is a 1 minute time limit on each image. You do not need to use the full minute. Click 'Next' when you are done annotating an image.<br><br><i>Disclaimer: This HIT is part of a MIT scientific research project. Your decision to complete this HIT is voluntary. There is no way for us to identify you. The only information we will have, in addition to your responses, is the time at which you completed the survey. The results of the research may be presented at scientific meetings or published in scientific journals. Clicking on the 'SUBMIT' button on the bottom of this page indicates that you are at least 18 years of age and agree to complete this HIT voluntarily.</i>",
        "steps": [
            "An image will be shown. Analyze it and identify the most important parts.",
            "Label those parts with one of the 3 available tools: Regular Stroke, Stroke Fill or Polygon Fill.",
            "Once you are done, click Next to go to the next image.",
            "Repeat the process until all images are annotated. At that point, you can click submit to finish the task."
        ],
        "images": ["https://cfosco.github.io/mturk-importance/img/example1_importance_labeling.gif"]
    },
    "hitCreation": {
        "title": "Annotate the most important regions on graphic designs",
        "description": "Manually highlight the important parts of a graphic design. You will be shown a set of 10 images, and you will have to indicate which parts feel important to you.",
        "numTasks": 1,
        "numAssignments": 10,
        "rewardAmount": "0.00",
        "keywords": "labeling, importance, highlighting",
        "duration": 1200,
        "lifetime": 186400,
        "taskUrl": "https://cfosco.github.io/mturk-importance/",
        "fold": "fold_info.txt",
        "production": false
    },
    "advanced": {
        "includeDemographicSurvey": false,
        "hideIfNotAccepted": false,
        "externalSubmit": false,
        "externalSubmitUrl": ""
    }
}
